app/Reply.php

insert into "favorites" ("user_id", "favorited_id", "favorited_type", "updated_at", "created_at") values ('1', '17', 'App\Reply', '2017-12-27 17:09:04', '2017-12-27 17:09:04') returning "id"
---
   public function favorite()
   {
       $attributes = ['user_id' => auth()->id()];

       if(! $this->favorites()->where($attributes)->exists()){

    	   return $this->favorites()->create($attributes);