app/Thread.php

    public function addReply($reply)
    {
        $this->replies()->create($reply);
---
insert into "replies" ("body", "user_id", "thread_id", "updated_at", "created_at") values ('another', '1', '2', '2017-12-27 17:09:22', '2017-12-27 17:09:22') returning "id"