app/Http/Controllers/ChannelController.php

select * from "channels" where "channels"."id" in ('2')
---
    public function index(Channel $channel)
    {
        $threads = $channel->threads()->latest()->with('creator', 'channel')->get();