app/Http/Controllers/ProfileController.php

select * from "replies" where "replies"."user_id" = '1' and "replies"."user_id" is not null
select count(*) as aggregate from "threads" where "threads"."user_id" = '1' and "threads"."user_id" is not null
---
    public function show(User $user)
    {

    	return view('profiles.show', [

    		'profileUser' => $user,
    		'threads' => $user->threads()->paginate(15),
			'replies' => $user->replies
    		]);