app/Http/Controllers/ReplyController.php

delete from "replies" where "id" = '311'
---
    public function destroy(Reply $reply)
    {
        $this->authorize('update', $reply);

        $reply->delete();