app/Http/Controllers/ThreadController.php

    public function index(ThreadFilters $filters)
    {
        $threads = Thread::with('channel','creator')->filter($filters)->latest()->get();
---
select * from "channels" where "channels"."id" in ('1', '2', '3', '4', '5', '6')

    public function show(Channel $channel, Thread $thread)
    {
        return view('threads.show',[

            'thread' => $thread,
            'replies' => $thread->replies()->with('owner')->paginate(20)

            ]);
---
select * from "replies" where "replies"."thread_id" = '2' and "replies"."thread_id" is not null limit 20 offset 0
select count(*) as aggregate from "replies" where "replies"."thread_id" = '2' and "replies"."thread_id" is not null