app/Providers/AppServiceProvider.php

    public function boot()
    {
        if (Schema::hasTable('channels')) {
            \View::share('channels', Channel::all());
---
select * from "channels"